# Выведите число π с заданной точностью. Точность вводится пользователем в виде натурального числа
import math
n = 4
print(round(math.pi, n))